dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-sw-wdt
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Original ESP32 has no assist-debug module
# (SOC_ASSIST_DEBUG_SUPPORTED is unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# isn't available here -- pair with the end-of-stack hardware watchpoint for
# deterministic (not sampled-at-context-switch) detection. See
# components/bb_health/Kconfig.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Compile-gate for the bb_task_registry software watchdog monitor task
# (default n; a no-op stub compiles in when off). Migrated to
# bb_task_create() in B1-1364 PR3 -- this env is what actually exercises
# that call site (platform/espidf/bb_task_registry/bb_task_registry_monitor.c)
# on-target, since [board.native] resolves platform="host" and never
# compiles this espidf-only TU into the host test binary. See
# components/bb_task_registry/Kconfig.
CONFIG_BB_TASK_REGISTRY_SW_WDT=y

# B1-1482: same pin as sdkconfig.defaults.esp32 -- this board also only ever
# composes 2 genuinely-blocking clients (SSE+WS, examples/smoke/main/
# bb_wire.h), so pin the blocking-client budget to that real usage rather
# than letting it silently track the new CONFIG_BB_DATA_HTTP_MAX_CLIENTS
# default of 3 (which would trip bb_data_http_espidf.c's compile-time
# guard: 3*20=60ms >= the 50ms default sweep interval).
CONFIG_BB_DATA_HTTP_MAX_BLOCKING_CLIENTS=2
